# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()


#Your code here; import the necessary packages

In [3]:
#Your code here; create the connection and cursor

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [18]:
#Your code here; use a subquery. No join will be necessary.
c.execute('''select customerNumber, contactLastName, contactFirstName from customers where customerNumber in (select customerNumber from orders where orderDate = '2003-01-31')''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [32]:
c.execute('''select productName, COUNT(orderNumber), sum(quantityOrdered) from products join orderdetails using(productCode) group by 1 order by 2 desc;''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head(20)
len(df)

109

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [43]:
c.execute('''select productName, count(distinct customerNumber) from products
                            join orderdetails using(productCode) 
                            join orders using(orderNumber) group by 1 order by 2 
                            desc''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head(20)

                                productName  count(distinct customerNumber)
0               1992 Ferrari 360 Spider red                              40
1                        1934 Ford V8 Coupe                              27
2                  1952 Alpine Renault 1300                              27
3                       1972 Alfa Romeo GTA                              27
4                          Boeing X-32A JSF                              27
5       18th Century Vintage Horse Carriage                              26
6                    1900s Vintage Bi-Plane                              26
7               1913 Ford Model T Speedster                              26
8                 1937 Horch 930V Limousine                              26
9                  1940 Ford Delivery Sedan                              26
10  1941 Chevrolet Special Deluxe Cabriolet                              26
11    1969 Harley Davidson Ultimate Chopper                              26
12              1980s Black Hawk Helicopter                              26
13                         1995 Honda Civic                              26
14                    1996 Moto Guzzi 1100i                              26
15                   1999 Yamaha Speed Boat                              26
16                American Airlines: MD-11S                              26
17                 Corsair F4U ( Bird Cage)                              26
18                               HMS Bounty                              26
19         1912 Ford Model T Delivery Wagon                              25

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [44]:
c.execute('''select employeeNumber, officeCode, lastName, firstName 
                            from employees a 
                            join customers b 
                            where a.employeeNumber = b.salesRepEmployeeNumber                             
                            
                            (salesRepEmployeeNumber from customers
                            join orders where 
                            join orders using(customerNumber) 
                            join orderDetails 
                            using(orderNumber) 
                            
                            (select  count(ordernumber) < 20
                            
                            group by 1 having count(distinct productNumber) ''')

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!